yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
/**
 * @var HSUSBD_T::GINTSTS
 * Offset: 0x00  Global Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |USBIF     |USB Interrupt
 * |        |          |This bit conveys the interrupt status for USB specific events endpoint
 * |        |          |When set, USB interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[1]     |CEPIF     |Control Endpoint Interrupt
 * |        |          |This bit conveys the interrupt status for control endpoint
 * |        |          |When set, Control-epu2019s interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[2]     |EPAIF     |Endpoint A Interrupt
 * |        |          |When set, the corresponding Endpoint A's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[3]     |EPBIF     |Endpoint B Interrupt
 * |        |          |When set, the corresponding Endpoint B's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[4]     |EPCIF     |Endpoint C Interrupt
 * |        |          |When set, the corresponding Endpoint C's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[5]     |EPDIF     |Endpoint D Interrupt
 * |        |          |When set, the corresponding Endpoint D's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[6]     |EPEIF     |Endpoint E Interrupt
 * |        |          |When set, the corresponding Endpoint E's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[7]     |EPFIF     |Endpoint F Interrupt
 * |        |          |When set, the corresponding Endpoint F's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[8]     |EPGIF     |Endpoint G Interrupt
 * |        |          |When set, the corresponding Endpoint G's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[9]     |EPHIF     |Endpoint H Interrupt
 * |        |          |When set, the corresponding Endpoint Hu2019s interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[10]    |EPIIF     |Endpoint I Interrupt
 * |        |          |When set, the corresponding Endpoint I's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[11]    |EPJIF     |Endpoint J Interrupt
 * |        |          |When set, the corresponding Endpoint J's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[12]    |EPKIF     |Endpoint K Interrupt
 * |        |          |When set, the corresponding Endpoint K's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * |[13]    |EPLIF     |Endpoint L Interrupt
 * |        |          |When set, the corresponding Endpoint L's interrupt status register should be read to determine the cause of the interrupt.
 * |        |          |0 = No interrupt event occurred.
 * |        |          |1 = The related interrupt event occurred.
 * @var HSUSBD_T::GINTEN
 * Offset: 0x08  Global Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |USBIEN    |USB Interrupt Enable Bit
 * |        |          |When set, this bit enables a local interrupt to be generated when a USB event occurs on the bus.
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[1]     |CEPIEN    |Control Endpoint Interrupt Enable Bit
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the control endpoint.
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[2]     |EPAIEN    |Interrupt Enable Control for Endpoint A
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint A.
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[3]     |EPBIEN    |Interrupt Enable Control for Endpoint B
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint B
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[4]     |EPCIEN    |Interrupt Enable Control for Endpoint C
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint C
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[5]     |EPDIEN    |Interrupt Enable Control for Endpoint D
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint D
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[6]     |EPEIEN    |Interrupt Enable Control for Endpoint E
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint E
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[7]     |EPFIEN    |Interrupt Enable Control for Endpoint F
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint F
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[8]     |EPGIEN    |Interrupt Enable Control for Endpoint G
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint G
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[9]     |EPHIEN    |Interrupt Enable Control for Endpoint H
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint H
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[10]    |EPIIEN    |Interrupt Enable Control for Endpoint I
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint I
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[11]    |EPJIEN    |Interrupt Enable Control for Endpoint J
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint J
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[12]    |EPKIEN    |Interrupt Enable Control for Endpoint K
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint K
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * |[13]    |EPLIEN    |Interrupt Enable Control for Endpoint L
 * |        |          |When set, this bit enables a local interrupt to be generated when an interrupt is pending for the endpoint L
 * |        |          |0 = The related interrupt Disabled.
 * |        |          |1 = The related interrupt Enabled.
 * @var HSUSBD_T::BUSINTSTS
 * Offset: 0x10  USB Bus Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SOFIF     |SOF Receive Control Interrupt
 * |        |          |This bit indicates when a start-of-frame packet has been received.
 * |        |          |0 = No start-of-frame packet has been received.
 * |        |          |1 = Start-of-frame packet has been received.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[1]     |RSTIF     |Reset Interrupt
 * |        |          |When set, this bit indicates that either the USB root port reset is end.
 * |        |          |0 = No USB root port reset is end.
 * |        |          |1 = USB root port reset is end.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[2]     |RESUMEIF  |Resume Interrupt
 * |        |          |When set, this bit indicates that a device resume has occurred.
 * |        |          |0 = No device resume has occurred.
 * |        |          |1 = Device resume has occurred.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[3]     |SUSPENDIF |Suspend Request Interrupt
 * |        |          |This bit is set as default and it has to be cleared by writing u20181u2019 before the USB reset
 * |        |          |This bit is also set when a USB Suspend request is detected from the host.
 * |        |          |0 = No USB Suspend request is detected from the host.
 * |        |          |1= USB Suspend request is detected from the host.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[4]     |HISPDIF   |High-speed Settle Interrupt
 * |        |          |0 = No valid high-speed reset protocol is detected.
 * |        |          |1 = Valid high-speed reset protocol is over and the device has settled in high-speed.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[5]     |DMADONEIF |DMA Completion Interrupt
 * |        |          |0 = No DMA transfer over.
 * |        |          |1 = DMA transfer is over.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[6]     |PHYCLKVLDIF|Usable Clock Interrupt
 * |        |          |0 = Usable clock is not available.
 * |        |          |1 = Usable clock is available from the transceiver.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[8]     |VBUSDETIF |VBUS Detection Interrupt
 * |        |          |0 = No VBUS is plug-in.
 * |        |          |1 = VBUS is plug-in.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[9]     |LPMTKNIF  |LPM Token Interrupt
 * |        |          |0 = No LPM token has been received from the host.
 * |        |          |1 = A LPM token has been received from the host.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * @var HSUSBD_T::BUSINTEN
 * Offset: 0x14  USB Bus Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SOFIEN    |SOF Interrupt Enable Bit
 * |        |          |This bit enables the SOF interrupt.
 * |        |          |0 = SOF interrupt Disabled.
 * |        |          |1 = SOF interrupt Enabled.
 * |[1]     |RSTIEN    |Reset Interrupt Enable Bit
 * |        |          |This bit enables the USB-Reset interrupt.
 * |        |          |0 = USB-Reset interrupt Disabled.
 * |        |          |1 = USB-Reset interrupt Enabled.
 * |[2]     |RESUMEIEN |Resume Interrupt Enable Bit
 * |        |          |This bit enables the Resume interrupt.
 * |        |          |0 = Resume interrupt Disabled.
 * |        |          |1 = Resume interrupt Enabled.
 * |[3]     |SUSPENDIEN|Suspend Request Interrupt Enable Bit
 * |        |          |This bit enables the Suspend interrupt.
 * |        |          |0 = Suspend interrupt Disabled.
 * |        |          |1 = Suspend interrupt Enabled.
 * |[4]     |HISPDIEN  |High-speed Settle Interrupt Enable Bit
 * |        |          |This bit enables the high-speed settle interrupt.
 * |        |          |0 = High-speed settle interrupt Disabled.
 * |        |          |1 = High-speed settle interrupt Enabled.
 * |[5]     |DMADONEIEN|DMA Completion Interrupt Enable Bit
 * |        |          |This bit enables the DMA completion interrupt
 * |        |          |0 = DMA completion interrupt Disabled.
 * |        |          |1 = DMA completion interrupt Enabled.
 * |[6]     |PHYCLKVLDIEN|Usable Clock Interrupt Enable Bit
 * |        |          |This bit enables the usable clock interrupt.
 * |        |          |0 = Usable clock interrupt Disabled.
 * |        |          |1 = Usable clock interrupt Enabled.
 * |[8]     |VBUSDETIEN|VBUS Detection Interrupt Enable Bit
 * |        |          |This bit enables the VBUS floating detection interrupt.
 * |        |          |0 = VBUS floating detection interrupt Disabled.
 * |        |          |1 = VBUS floating detection interrupt Enabled.
 * |[9]     |LPMTKNIEN |LPM Token Interrupt Enable Bit
 * |        |          |0 = The LPM token interrupt Disabled.
 * |        |          |1 = The LPM token interrupt Enabled.
 * @var HSUSBD_T::OPER
 * Offset: 0x18  USB Operational Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RESUMEEN  |Generate Resume
 * |        |          |0 = No Resume sequence to be initiated to the host.
 * |        |          |1 = A Resume sequence to be initiated to the host if device remote wakeup is enabled
 * |        |          |This bit is self-clearing.
 * |[1]     |HISPDEN   |USB High-speed
 * |        |          |0 = The USB device controller to suppress the chirp-sequence during reset protocol, thereby allowing the USB device controller to settle in full-speed, even though it is connected to a USB2.0 Host.
 * |        |          |1 = The USB device controller to initiate a chirp-sequence during reset protocol.
 * |[2]     |CURSPD    |USB Current Speed
 * |        |          |0 = The device has settled in full-speed.
 * |        |          |1 = The USB device controller has settled in high-speed.
 * |[3]     |HISHSEN   |USB High-speed Handshake Enable Bit
 * |        |          |0 = The USB device can not start high speed handshake.
 * |        |          |1 = The USB device can start high speed handshake.
 * @var HSUSBD_T::FRAMECNT
 * Offset: 0x1C  USB Frame Count Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |MFRAMECNT |Micro-frame Counter
 * |        |          |This field contains the micro-frame number for the frame number in the frame counter field.
 * |[13:3]  |FRAMECNT  |Frame Counter
 * |        |          |This field contains the frame count from the most recent start-of-frame packet.
 * @var HSUSBD_T::FADDR
 * Offset: 0x20  USB Function Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[6:0]   |FADDR     |USB Function Address
 * |        |          |This field contains the current USB address of the device
 * |        |          |This field is cleared when a root port reset is detected
 * @var HSUSBD_T::TEST
 * Offset: 0x24  USB Test Mode Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |TESTMODE  |Test Mode Selection
 * |        |          |000 = Normal Operation.
 * |        |          |001 = Test_J.
 * |        |          |010 = Test_K.
 * |        |          |011 = Test_SE0_NAK.
 * |        |          |100 = Test_Packet.
 * |        |          |101 = Test_Force_Enable.
 * |        |          |110 = Reserved.
 * |        |          |111 = Reserved.
 * |        |          |Note: This field is cleared when root port reset is detected.
 * @var HSUSBD_T::CEPDAT
 * Offset: 0x28  Control-endpoint Data Buffer
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |DAT       |Control-endpoint Data Buffer
 * |        |          |Control endpoint data buffer for the buffer transaction (read or write).
 * |        |          |Note: Only word or byte access are supported.
 * @var HSUSBD_T::CEPCTL
 * Offset: 0x2C  Control-endpoint Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |NAKCLR    |No Acknowledge Control
 * |        |          |This bit plays a crucial role in any control transfer.
 * |        |          |0 = The bit is being cleared by the local CPU by writing zero, the USB device controller will be responding with NAKs for the subsequent status phase
 * |        |          |This mechanism holds the host from moving to the next request, until the local CPU is also ready to process the next request.
 * |        |          |1 = This bit is set to one by the USB device controller, whenever a setup token is received
 * |        |          |The local CPU can take its own time to finish off any house-keeping work based on the request and then clear this bit.
 * |        |          |Note: Only when CPU writes data[1:0] is 2u2019b10 or 2u2019b00, this bit can be updated.
 * |[1]     |STALLEN   |Stall Enable Bit
 * |        |          |When this stall bit is set, the control endpoint sends a stall handshake in response to any in or out token thereafter
 * |        |          |This is typically used for response to invalid/unsupported requests
 * |        |          |When this bit is being set the NAK clear bit has to be cleared at the same time since the NAK clear bit has highest priority than STALL
 * |        |          |It is automatically cleared on receipt of a next setup-token
 * |        |          |So, the local CPU need not write again to clear this bit.
 * |        |          |0 = No sends a stall handshake in response to any in or out token thereafter.
 * |        |          |1 = The control endpoint sends a stall handshake in response to any in or out token thereafter.
 * |        |          |Note: Only when CPU writes data[1:0] is 2u2019b10 or 2u2019b00, this bit can be updated.
 * |[2]     |ZEROLEN   |Zero Packet Length
 * |        |          |This bit is valid for Auto Validation mode only.
 * |        |          |0 = No zero length packet to the host during Data stage to an IN token.
 * |        |          |1 = USB device controller can send a zero length packet to the host during Data stage to an IN token
 * |        |          |This bit gets cleared once the zero length data packet is sent
 * |        |          |So, the local CPU need not write again to clear this bit.
 * |[3]     |FLUSH     |CEP-flush Bit
 * |        |          |0 = No the packet buffer and its corresponding HSUSBD_CEPDATCNT register to be cleared.
 * |        |          |1 = The packet buffer and its corresponding HSUSBD_CEPDATCNT register to be cleared
 * |        |          |This bit is self-cleaning.
 * @var HSUSBD_T::CEPINTEN
 * Offset: 0x30  Control-endpoint Interrupt Enable
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SETUPTKIEN|Setup Token Interrupt Enable Bit
 * |        |          |0 = The SETUP token interrupt in Control Endpoint Disabled.
 * |        |          |1 = The SETUP token interrupt in Control Endpoint Enabled.
 * |[1]     |SETUPPKIEN|Setup Packet Interrupt Enable Bit
 * |        |          |0 = The SETUP packet interrupt in Control Endpoint Disabled.
 * |        |          |1 = The SETUP packet interrupt in Control Endpoint Enabled.
 * |[2]     |OUTTKIEN  |Out Token Interrupt Enable Bit
 * |        |          |0 = The OUT token interrupt in Control Endpoint Disabled.
 * |        |          |1 = The OUT token interrupt in Control Endpoint Enabled.
 * |[3]     |INTKIEN   |In Token Interrupt Enable Bit
 * |        |          |0 = The IN token interrupt in Control Endpoint Disabled.
 * |        |          |1 = The IN token interrupt in Control Endpoint Enabled.
 * |[4]     |PINGIEN   |Ping Token Interrupt Enable Bit
 * |        |          |0 = The ping token interrupt in Control Endpoint Disabled.
 * |        |          |1 = The ping token interrupt Control Endpoint Enabled.
 * |[5]     |TXPKIEN   |Data Packet Transmitted Interrupt Enable Bit
 * |        |          |0 = The data packet transmitted interrupt in Control Endpoint Disabled.
 * |        |          |1 = The data packet transmitted interrupt in Control Endpoint Enabled.
 * |[6]     |RXPKIEN   |Data Packet Received Interrupt Enable Bit
 * |        |          |0 = The data received interrupt in Control Endpoint Disabled.
 * |        |          |1 = The data received interrupt in Control Endpoint Enabled.
 * |[7]     |NAKIEN    |NAK Sent Interrupt Enable Bit
 * |        |          |0 = The NAK sent interrupt in Control Endpoint Disabled.
 * |        |          |1 = The NAK sent interrupt in Control Endpoint Enabled.
 * |[8]     |STALLIEN  |STALL Sent Interrupt Enable Bit
 * |        |          |0 = The STALL sent interrupt in Control Endpoint Disabled.
 * |        |          |1 = The STALL sent interrupt in Control Endpoint Enabled.
 * |[9]     |ERRIEN    |USB Error Interrupt Enable Bit
 * |        |          |0 = The USB Error interrupt in Control Endpoint Disabled.
 * |        |          |1 = The USB Error interrupt in Control Endpoint Enabled.
 * |[10]    |STSDONEIEN|Status Completion Interrupt Enable Bit
 * |        |          |0 = The Status Completion interrupt in Control Endpoint Disabled.
 * |        |          |1 = The Status Completion interrupt in Control Endpoint Enabled.
 * |[11]    |BUFFULLIEN|Buffer Full Interrupt Enable Bit
 * |        |          |0 = The buffer full interrupt in Control Endpoint Disabled.
