yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
 * |        |          |1 = The buffer full interrupt in Control Endpoint Enabled.
 * |[12]    |BUFEMPTYIEN|Buffer Empty Interrupt Enable Bit
 * |        |          |0 = The buffer empty interrupt in Control Endpoint Disabled.
 * |        |          |1= The buffer empty interrupt in Control Endpoint Enabled.
 * @var HSUSBD_T::CEPINTSTS
 * Offset: 0x34  Control-endpoint Interrupt Status
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SETUPTKIF |Setup Token Interrupt
 * |        |          |0 = Not a Setup token is received.
 * |        |          |1 = A Setup token is received. Writing 1 clears this status bit
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[1]     |SETUPPKIF |Setup Packet Interrupt
 * |        |          |This bit must be cleared (by writing 1) before the next setup packet can be received
 * |        |          |If the bit is not cleared, then the successive setup packets will be overwritten in the setup packet buffer.
 * |        |          |0 = Not a Setup packet has been received from the host.
 * |        |          |1 = A Setup packet has been received from the host.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[2]     |OUTTKIF   |Out Token Interrupt
 * |        |          |0 = The control-endpoint does not receive an OUT token from the host.
 * |        |          |1 = The control-endpoint receives an OUT token from the host.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[3]     |INTKIF    |In Token Interrupt
 * |        |          |0 = The control-endpoint does not receive an IN token from the host.
 * |        |          |1 = The control-endpoint receives an IN token from the host.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[4]     |PINGIF    |Ping Token Interrupt
 * |        |          |0 = The control-endpoint does not receive a ping token from the host.
 * |        |          |1 = The control-endpoint receives a ping token from the host.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[5]     |TXPKIF    |Data Packet Transmitted Interrupt
 * |        |          |0 = Not a data packet is successfully transmitted to the host in response to an IN-token and an ACK-token is received for the same.
 * |        |          |1 = A data packet is successfully transmitted to the host in response to an IN-token and an ACK-token is received for the same.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[6]     |RXPKIF    |Data Packet Received Interrupt
 * |        |          |0 = Not a data packet is successfully received from the host for an OUT-token and an ACK is sent to the host.
 * |        |          |1 = A data packet is successfully received from the host for an OUT-token and an ACK is sent to the host.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[7]     |NAKIF     |NAK Sent Interrupt
 * |        |          |0 = Not a NAK-token is sent in response to an IN/OUT token.
 * |        |          |1 = A NAK-token is sent in response to an IN/OUT token.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[8]     |STALLIF   |STALL Sent Interrupt
 * |        |          |0 = Not a stall-token is sent in response to an IN/OUT token.
 * |        |          |1 = A stall-token is sent in response to an IN/OUT token.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[9]     |ERRIF     |USB Error Interrupt
 * |        |          |0 = No error had occurred during the transaction.
 * |        |          |1 = An error had occurred during the transaction.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[10]    |STSDONEIF |Status Completion Interrupt
 * |        |          |0 = Not a USB transaction has completed successfully.
 * |        |          |1 = The status stage of a USB transaction has completed successfully.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[11]    |BUFFULLIF |Buffer Full Interrupt
 * |        |          |0 = The control-endpoint buffer is not full.
 * |        |          |1 = The control-endpoint buffer is full.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[12]    |BUFEMPTYIF|Buffer Empty Interrupt
 * |        |          |0 = The control-endpoint buffer is not empty.
 * |        |          |1 = The control-endpoint buffer is empty.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * @var HSUSBD_T::CEPTXCNT
 * Offset: 0x38  Control-endpoint In-transfer Data Count
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TXCNT     |In-transfer Data Count
 * |        |          |There is no mode selection for the control endpoint (but it operates like manual mode)
 * |        |          |The local-CPU has to fill the control-endpoint buffer with the data to be sent for an in-token and to write the count of bytes in this register
 * |        |          |When zero is written into this field, a zero length packet is sent to the host
 * |        |          |When the count written in the register is more than the MPS, the data sent will be of only MPS.
 * @var HSUSBD_T::CEPRXCNT
 * Offset: 0x3C  Control-endpoint Out-transfer Data Count
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |RXCNT     |Out-transfer Data Count
 * |        |          |The USB device controller maintains the count of the data received in case of an out transfer, during the control transfer.
 * @var HSUSBD_T::CEPDATCNT
 * Offset: 0x40  Control-endpoint Data Count
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |DATCNT    |Control-endpoint Data Count
 * |        |          |The USB device controller maintains the count of the data of control-endpoint.
 * @var HSUSBD_T::SETUP1_0
 * Offset: 0x44  Setup1 & Setup0 Bytes
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |SETUP0    |Setup Byte 0[7:0]
 * |        |          |This register provides byte 0 of the last setup packet received
 * |        |          |For a Standard Device Request, the following bmRequestType information is returned.
 * |        |          |Bit 7 (Direction):
 * |        |          | 0 = Host to dev.ice
 * |        |          | 1 = Device to h.ost
 * |        |          |Bit 6-5 (Type):
 * |        |          | 00 = Stand.ard
 * |        |          | 01 = Cl.ass
 * |        |          | 10 = Ven.dor
 * |        |          | 11 = Reser.ved
 * |        |          |Bit 4-0 (Recipient)
 * |        |          | 00000 = Dev.ice
 * |        |          | 00001 = Interf.ace
 * |        |          | 00010 = Endpo.int
 * |        |          | 00011 = Ot.her
 * |        |          | Others = Reser.ved
 * |[15:8]  |SETUP1    |Setup Byte 1[15:8]
 * |        |          |This register provides byte 1 of the last setup packet received
 * |        |          |For a Standard Device Request, the following bRequest Code information is returned.
 * |        |          |00000000 = Get Status.
 * |        |          |00000001 = Clear Feature.
 * |        |          |00000010 = Reserved.
 * |        |          |00000011 = Set Feature.
 * |        |          |00000100 = Reserved.
 * |        |          |00000101 = Set Address.
 * |        |          |00000110 = Get Descriptor.
 * |        |          |00000111 = Set Descriptor.
 * |        |          |00001000 = Get Configuration.
 * |        |          |00001001 = Set Configuration.
 * |        |          |00001010 = Get Interface.
 * |        |          |00001011 = Set Interface.
 * |        |          |00001100 = Sync Frame.
 * @var HSUSBD_T::SETUP3_2
 * Offset: 0x48  Setup3 & Setup2 Bytes
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |SETUP2    |Setup Byte 2[7:0]
 * |        |          |This register provides byte 2 of the last setup packet received
 * |        |          |For a Standard Device Request, the least significant byte of the wValue field is returned
 * |[15:8]  |SETUP3    |Setup Byte 3[15:8]
 * |        |          |This register provides byte 3 of the last setup packet received
 * |        |          |For a Standard Device Request, the most significant byte of the wValue field is returned.
 * @var HSUSBD_T::SETUP5_4
 * Offset: 0x4C  Setup5 & Setup4 Bytes
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |SETUP4    |Setup Byte 4[7:0]
 * |        |          |This register provides byte 4 of the last setup packet received
 * |        |          |For a Standard Device Request, the least significant byte of the wIndex field is returned.
 * |[15:8]  |SETUP5    |Setup Byte 5[15:8]
 * |        |          |This register provides byte 5 of the last setup packet received
 * |        |          |For a Standard Device Request, the most significant byte of the wIndex field is returned.
 * @var HSUSBD_T::SETUP7_6
 * Offset: 0x50  Setup7 & Setup6 Bytes
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |SETUP6    |Setup Byte 6[7:0]
 * |        |          |This register provides byte 6 of the last setup packet received
 * |        |          |For a Standard Device Request, the least significant byte of the wLength field is returned.
 * |[15:8]  |SETUP7    |Setup Byte 7[15:8]
 * |        |          |This register provides byte 7 of the last setup packet received
 * |        |          |For a Standard Device Request, the most significant byte of the wLength field is returned.
 * @var HSUSBD_T::CEPBUFSTART
 * Offset: 0x54  Control Endpoint RAM Start Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |SADDR     |Control-endpoint Start Address
 * |        |          |This is the start-address of the RAM space allocated for the control-endpoint.
 * @var HSUSBD_T::CEPBUFEND
 * Offset: 0x58  Control Endpoint RAM End Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |EADDR     |Control-endpoint End Address
 * |        |          |This is the end-address of the RAM space allocated for the control-endpoint.
 * @var HSUSBD_T::DMACTL
 * Offset: 0x5C  DMA Control Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |EPNUM     |DMA Endpoint Address Bits
 * |        |          |Used to define the Endpoint Address
 * |[4]     |DMARD     |DMA Operation
 * |        |          |0 = The operation is a DMA write (read from USB buffer)
 * |        |          |DMA will check endpoint data available count (HSUSBD_EPxDATCNT) according to EPNUM setting before to perform DMA write operation.
 * |        |          |1 = The operation is a DMA read (write to USB buffer).
 * |[5]     |DMAEN     |DMA Enable Bit
 * |        |          |0 = DMA function Disabled.
 * |        |          |1 = DMA function Enabled.
 * |[6]     |SGEN      |Scatter Gather Function Enable Bit
 * |        |          |0 = Scatter gather function Disabled.
 * |        |          |1 = Scatter gather function Enabled.
 * |[7]     |DMARST    |Reset DMA State Machine
 * |        |          |0 = No reset the DMA state machine.
 * |        |          |1 = Reset the DMA state machine.
 * |[8]     |SVINEP    |Serve IN Endpoint
 * |        |          |This bit is used to specify DMA serving endpoint-IN endpoint or OUT endpoint.
 * |        |          |0 = DMA serves OUT endpoint.
 * |        |          |1 = DMA serves IN endpoint.
 * @var HSUSBD_T::DMACNT
 * Offset: 0x60  DMA Count Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[19:0]  |DMACNT    |DMA Transfer Count
 * |        |          |The transfer count of the DMA operation to be performed is written to this register.
 * @var HSUSBD_T::LPMCSR
 * Offset: 0x6FC  LPM Control and Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[10:0]  |bmAttributes|The LPM Token bmAttributes Field Definition (Read Only)
 * |        |          |Bit 10-9 (Reserved)
 * |        |          |Bit 8 (bRemoteWake)
 * |        |          |Bit 7-4 (HIRD)
 * |        |          |Bit 3-0 (bLinkState):
 * |        |          | 0000 = Reser.ved
 * |        |          | 0001 = L1 (Sle.ep)
 * |        |          | 0010 u2013 1111 = Reser.ved
 * |[12]    |LPMEN     |LPM Function Enable Bit
 * |        |          |0 = The LPM function Disabled.
 * |        |          |1 = The LPM function Enabled.
 * |[13]    |LPMSLEEPEN|LPM Sleep Function Enable Bit
 * |        |          |0 = The LPM sleep function Disabled.
 * |        |          |1 = The LPM sleep function Enabled.
 * |[14]    |LPMSENDNYET|LPM Send NYET Response
 * |        |          |0 = Not send a NYET handshake as response to the LPM token.
 * |        |          |1 = Send a NYET handshake as response to the LPM token.
 * @var HSUSBD_T::DMAADDR
 * Offset: 0x700  AHB DMA Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |DMAADDR   |DMAADDR
 * |        |          |The register specifies the address from which the DMA has to read / write
 * |        |          |The address must WORD (32-bit) aligned.
 * @var HSUSBD_T::PHYCTL
 * Offset: 0x704  USB PHY Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[8]     |DPPUEN    |DP Pull-up Enable Bit
 * |        |          |0 = Pull-up resistor on D+ Disabled.
 * |        |          |1 = Pull-up resistor on D+ Enabled.
 * |[9]     |PHYEN     |PHY Suspend Enable Bit
 * |        |          |0 = The USB PHY is suspend.
 * |        |          |1 = The USB PHY is not suspend.
 * |[24]    |VBUSWKEN  |VBUS Wake-up Enable Bit
 * |        |          |0 = The wake-up function Disabled.
 * |        |          |1 = The wake-up function Enabled.
 * |[25]    |LINESTATEWKEN|Line State Wake-up Enable Bit
 * |        |          |0 = The Line State wake-up function Disabled.
 * |        |          |1 = The Line State wake-up function Enabled.
 * |[26]    |STALLREVERT|Stall Revert Write Pointer Enable Bit
 * |        |          |0 = The Stall revert write pointer function Disabled.
 * |        |          |1 = The Stall revert write pointer function Enabled.
 * |[27]    |PHYCLKSTB |PHY Clock Stable Flag
 * |        |          |0 = The PHY clock is not stable for USB device usage.
 * |        |          |1 = The PHY clock is stable for USB device usage.
 * |[31]    |VBUSDET   |VBUS Status
 * |        |          |0 = The VBUS is not detected yet.
 * |        |          |1 = The VBUS is detected.
 */
    __I  uint32_t GINTSTS;               /*!< [0x0000] Global Interrupt Status Register                                 */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t GINTEN;                /*!< [0x0008] Global Interrupt Enable Register                                 */
    __I  uint32_t RESERVE1[1];
    __IO uint32_t BUSINTSTS;             /*!< [0x0010] USB Bus Interrupt Status Register                                */
    __IO uint32_t BUSINTEN;              /*!< [0x0014] USB Bus Interrupt Enable Register                                */
    __IO uint32_t OPER;                  /*!< [0x0018] USB Operational Register                                         */
    __I  uint32_t FRAMECNT;              /*!< [0x001c] USB Frame Count Register                                         */
    __IO uint32_t FADDR;                 /*!< [0x0020] USB Function Address Register                                    */
    __IO uint32_t TEST;                  /*!< [0x0024] USB Test Mode Register                                           */
    union
    {
        __IO uint32_t CEPDAT;
        __IO uint8_t  CEPDAT_BYTE;
    };                                   /*!< [0x0028] Control-Endpoint Data Buffer                                     */
    __IO uint32_t CEPCTL;                /*!< [0x002c] Control-endpoint Control Register                                */
    __IO uint32_t CEPINTEN;              /*!< [0x0030] Control-endpoint Interrupt Enable                                */
    __IO uint32_t CEPINTSTS;             /*!< [0x0034] Control-endpoint Interrupt Status                                */
    __IO uint32_t CEPTXCNT;              /*!< [0x0038] Control-endpoint In-transfer Data Count                          */
    __I  uint32_t CEPRXCNT;              /*!< [0x003c] Control-endpoint Out-transfer Data Count                         */
    __I  uint32_t CEPDATCNT;             /*!< [0x0040] Control-endpoint Data Count                                      */
    __I  uint32_t SETUP1_0;              /*!< [0x0044] Setup1 & Setup0 Bytes                                            */
    __I  uint32_t SETUP3_2;              /*!< [0x0048] Setup3 & Setup2 Bytes                                            */
    __I  uint32_t SETUP5_4;              /*!< [0x004c] Setup5 & Setup4 Bytes                                            */
    __I  uint32_t SETUP7_6;              /*!< [0x0050] Setup7 & Setup6 Bytes                                            */
    __IO uint32_t CEPBUFSTART;           /*!< [0x0054] Control Endpoint RAM Start Address Register                      */
    __IO uint32_t CEPBUFEND;             /*!< [0x0058] Control Endpoint RAM End Address Register                        */
    __IO uint32_t DMACTL;                /*!< [0x005c] DMA Control Status Register                                      */
    __IO uint32_t DMACNT;                /*!< [0x0060] DMA Count Register                                               */

