yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
    HSUSBD_EP_T EP[12];

    __I  uint32_t RESERVE2[302];
    __IO uint32_t LPMCSR;                /*!< [0x06fc] LPM Control and Status Register                                  */
    __IO uint32_t DMAADDR;               /*!< [0x0700] AHB DMA Address Register                                         */
    __IO uint32_t PHYCTL;                /*!< [0x0704] USB PHY Control Register                                         */

} HSUSBD_T;

/**
    @addtogroup HSUSBD_CONST HSUSBD Bit Field Definition
    Constant Definitions for HSUSBD Controller
@{ */

#define HSUSBD_GINTSTS_USBIF_Pos           (0)                                               /*!< HSUSBD_T::GINTSTS: USBIF Position        */
#define HSUSBD_GINTSTS_USBIF_Msk           (0x1ul << HSUSBD_GINTSTS_USBIF_Pos)               /*!< HSUSBD_T::GINTSTS: USBIF Mask            */

#define HSUSBD_GINTSTS_CEPIF_Pos           (1)                                               /*!< HSUSBD_T::GINTSTS: CEPIF Position        */
#define HSUSBD_GINTSTS_CEPIF_Msk           (0x1ul << HSUSBD_GINTSTS_CEPIF_Pos)               /*!< HSUSBD_T::GINTSTS: CEPIF Mask            */

#define HSUSBD_GINTSTS_EPAIF_Pos           (2)                                               /*!< HSUSBD_T::GINTSTS: EPAIF Position        */
#define HSUSBD_GINTSTS_EPAIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPAIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPAIF Mask            */

#define HSUSBD_GINTSTS_EPBIF_Pos           (3)                                               /*!< HSUSBD_T::GINTSTS: EPBIF Position        */
#define HSUSBD_GINTSTS_EPBIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPBIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPBIF Mask            */

#define HSUSBD_GINTSTS_EPCIF_Pos           (4)                                               /*!< HSUSBD_T::GINTSTS: EPCIF Position        */
#define HSUSBD_GINTSTS_EPCIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPCIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPCIF Mask            */

#define HSUSBD_GINTSTS_EPDIF_Pos           (5)                                               /*!< HSUSBD_T::GINTSTS: EPDIF Position        */
#define HSUSBD_GINTSTS_EPDIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPDIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPDIF Mask            */

#define HSUSBD_GINTSTS_EPEIF_Pos           (6)                                               /*!< HSUSBD_T::GINTSTS: EPEIF Position        */
#define HSUSBD_GINTSTS_EPEIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPEIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPEIF Mask            */

#define HSUSBD_GINTSTS_EPFIF_Pos           (7)                                               /*!< HSUSBD_T::GINTSTS: EPFIF Position        */
#define HSUSBD_GINTSTS_EPFIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPFIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPFIF Mask            */

#define HSUSBD_GINTSTS_EPGIF_Pos           (8)                                               /*!< HSUSBD_T::GINTSTS: EPGIF Position        */
#define HSUSBD_GINTSTS_EPGIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPGIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPGIF Mask            */

#define HSUSBD_GINTSTS_EPHIF_Pos           (9)                                               /*!< HSUSBD_T::GINTSTS: EPHIF Position        */
#define HSUSBD_GINTSTS_EPHIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPHIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPHIF Mask            */

#define HSUSBD_GINTSTS_EPIIF_Pos           (10)                                              /*!< HSUSBD_T::GINTSTS: EPIIF Position        */
#define HSUSBD_GINTSTS_EPIIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPIIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPIIF Mask            */

#define HSUSBD_GINTSTS_EPJIF_Pos           (11)                                              /*!< HSUSBD_T::GINTSTS: EPJIF Position        */
#define HSUSBD_GINTSTS_EPJIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPJIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPJIF Mask            */

#define HSUSBD_GINTSTS_EPKIF_Pos           (12)                                              /*!< HSUSBD_T::GINTSTS: EPKIF Position        */
#define HSUSBD_GINTSTS_EPKIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPKIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPKIF Mask            */

#define HSUSBD_GINTSTS_EPLIF_Pos           (13)                                              /*!< HSUSBD_T::GINTSTS: EPLIF Position        */
#define HSUSBD_GINTSTS_EPLIF_Msk           (0x1ul << HSUSBD_GINTSTS_EPLIF_Pos)               /*!< HSUSBD_T::GINTSTS: EPLIF Mask            */

#define HSUSBD_GINTEN_USBIEN_Pos           (0)                                               /*!< HSUSBD_T::GINTEN: USBIEN Position        */
#define HSUSBD_GINTEN_USBIEN_Msk           (0x1ul << HSUSBD_GINTEN_USBIEN_Pos)               /*!< HSUSBD_T::GINTEN: USBIEN Mask            */

#define HSUSBD_GINTEN_CEPIEN_Pos           (1)                                               /*!< HSUSBD_T::GINTEN: CEPIEN Position        */
#define HSUSBD_GINTEN_CEPIEN_Msk           (0x1ul << HSUSBD_GINTEN_CEPIEN_Pos)               /*!< HSUSBD_T::GINTEN: CEPIEN Mask            */

#define HSUSBD_GINTEN_EPAIEN_Pos           (2)                                               /*!< HSUSBD_T::GINTEN: EPAIEN Position        */
#define HSUSBD_GINTEN_EPAIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPAIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPAIEN Mask            */

#define HSUSBD_GINTEN_EPBIEN_Pos           (3)                                               /*!< HSUSBD_T::GINTEN: EPBIEN Position        */
#define HSUSBD_GINTEN_EPBIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPBIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPBIEN Mask            */

#define HSUSBD_GINTEN_EPCIEN_Pos           (4)                                               /*!< HSUSBD_T::GINTEN: EPCIEN Position        */
#define HSUSBD_GINTEN_EPCIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPCIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPCIEN Mask            */

#define HSUSBD_GINTEN_EPDIEN_Pos           (5)                                               /*!< HSUSBD_T::GINTEN: EPDIEN Position        */
#define HSUSBD_GINTEN_EPDIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPDIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPDIEN Mask            */

#define HSUSBD_GINTEN_EPEIEN_Pos           (6)                                               /*!< HSUSBD_T::GINTEN: EPEIEN Position        */
#define HSUSBD_GINTEN_EPEIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPEIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPEIEN Mask            */

#define HSUSBD_GINTEN_EPFIEN_Pos           (7)                                               /*!< HSUSBD_T::GINTEN: EPFIEN Position        */
#define HSUSBD_GINTEN_EPFIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPFIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPFIEN Mask            */

#define HSUSBD_GINTEN_EPGIEN_Pos           (8)                                               /*!< HSUSBD_T::GINTEN: EPGIEN Position        */
#define HSUSBD_GINTEN_EPGIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPGIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPGIEN Mask            */

#define HSUSBD_GINTEN_EPHIEN_Pos           (9)                                               /*!< HSUSBD_T::GINTEN: EPHIEN Position        */
#define HSUSBD_GINTEN_EPHIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPHIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPHIEN Mask            */

#define HSUSBD_GINTEN_EPIIEN_Pos           (10)                                              /*!< HSUSBD_T::GINTEN: EPIIEN Position        */
#define HSUSBD_GINTEN_EPIIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPIIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPIIEN Mask            */

#define HSUSBD_GINTEN_EPJIEN_Pos           (11)                                              /*!< HSUSBD_T::GINTEN: EPJIEN Position        */
#define HSUSBD_GINTEN_EPJIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPJIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPJIEN Mask            */

#define HSUSBD_GINTEN_EPKIEN_Pos           (12)                                              /*!< HSUSBD_T::GINTEN: EPKIEN Position        */
#define HSUSBD_GINTEN_EPKIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPKIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPKIEN Mask            */

