yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
#define HSUSBD_GINTEN_EPLIEN_Pos           (13)                                              /*!< HSUSBD_T::GINTEN: EPLIEN Position        */
#define HSUSBD_GINTEN_EPLIEN_Msk           (0x1ul << HSUSBD_GINTEN_EPLIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPLIEN Mask            */

#define HSUSBD_BUSINTSTS_SOFIF_Pos         (0)                                               /*!< HSUSBD_T::BUSINTSTS: SOFIF Position      */
#define HSUSBD_BUSINTSTS_SOFIF_Msk         (0x1ul << HSUSBD_BUSINTSTS_SOFIF_Pos)             /*!< HSUSBD_T::BUSINTSTS: SOFIF Mask          */

#define HSUSBD_BUSINTSTS_RSTIF_Pos         (1)                                               /*!< HSUSBD_T::BUSINTSTS: RSTIF Position      */
#define HSUSBD_BUSINTSTS_RSTIF_Msk         (0x1ul << HSUSBD_BUSINTSTS_RSTIF_Pos)             /*!< HSUSBD_T::BUSINTSTS: RSTIF Mask          */

#define HSUSBD_BUSINTSTS_RESUMEIF_Pos      (2)                                               /*!< HSUSBD_T::BUSINTSTS: RESUMEIF Position   */
#define HSUSBD_BUSINTSTS_RESUMEIF_Msk      (0x1ul << HSUSBD_BUSINTSTS_RESUMEIF_Pos)          /*!< HSUSBD_T::BUSINTSTS: RESUMEIF Mask       */

#define HSUSBD_BUSINTSTS_SUSPENDIF_Pos     (3)                                               /*!< HSUSBD_T::BUSINTSTS: SUSPENDIF Position  */
#define HSUSBD_BUSINTSTS_SUSPENDIF_Msk     (0x1ul << HSUSBD_BUSINTSTS_SUSPENDIF_Pos)         /*!< HSUSBD_T::BUSINTSTS: SUSPENDIF Mask      */

#define HSUSBD_BUSINTSTS_HISPDIF_Pos       (4)                                               /*!< HSUSBD_T::BUSINTSTS: HISPDIF Position    */
#define HSUSBD_BUSINTSTS_HISPDIF_Msk       (0x1ul << HSUSBD_BUSINTSTS_HISPDIF_Pos)           /*!< HSUSBD_T::BUSINTSTS: HISPDIF Mask        */

#define HSUSBD_BUSINTSTS_DMADONEIF_Pos     (5)                                               /*!< HSUSBD_T::BUSINTSTS: DMADONEIF Position  */
#define HSUSBD_BUSINTSTS_DMADONEIF_Msk     (0x1ul << HSUSBD_BUSINTSTS_DMADONEIF_Pos)         /*!< HSUSBD_T::BUSINTSTS: DMADONEIF Mask      */

#define HSUSBD_BUSINTSTS_PHYCLKVLDIF_Pos   (6)                                               /*!< HSUSBD_T::BUSINTSTS: PHYCLKVLDIF Position*/
#define HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk   (0x1ul << HSUSBD_BUSINTSTS_PHYCLKVLDIF_Pos)       /*!< HSUSBD_T::BUSINTSTS: PHYCLKVLDIF Mask    */

#define HSUSBD_BUSINTSTS_VBUSDETIF_Pos     (8)                                               /*!< HSUSBD_T::BUSINTSTS: VBUSDETIF Position  */
#define HSUSBD_BUSINTSTS_VBUSDETIF_Msk     (0x1ul << HSUSBD_BUSINTSTS_VBUSDETIF_Pos)         /*!< HSUSBD_T::BUSINTSTS: VBUSDETIF Mask      */

#define HSUSBD_BUSINTSTS_LPMTKNIF_Pos      (9)                                               /*!< HSUSBD_T::BUSINTSTS: LPMTKNIF Position   */
#define HSUSBD_BUSINTSTS_LPMTKNIF_Msk      (0x1ul << HSUSBD_BUSINTSTS_LPMTKNIF_Pos)          /*!< HSUSBD_T::BUSINTSTS: LPMTKNIF Mask       */

#define HSUSBD_BUSINTEN_SOFIEN_Pos         (0)                                               /*!< HSUSBD_T::BUSINTEN: SOFIEN Position      */
#define HSUSBD_BUSINTEN_SOFIEN_Msk         (0x1ul << HSUSBD_BUSINTEN_SOFIEN_Pos)             /*!< HSUSBD_T::BUSINTEN: SOFIEN Mask          */

#define HSUSBD_BUSINTEN_RSTIEN_Pos         (1)                                               /*!< HSUSBD_T::BUSINTEN: RSTIEN Position      */
#define HSUSBD_BUSINTEN_RSTIEN_Msk         (0x1ul << HSUSBD_BUSINTEN_RSTIEN_Pos)             /*!< HSUSBD_T::BUSINTEN: RSTIEN Mask          */

#define HSUSBD_BUSINTEN_RESUMEIEN_Pos      (2)                                               /*!< HSUSBD_T::BUSINTEN: RESUMEIEN Position   */
#define HSUSBD_BUSINTEN_RESUMEIEN_Msk      (0x1ul << HSUSBD_BUSINTEN_RESUMEIEN_Pos)          /*!< HSUSBD_T::BUSINTEN: RESUMEIEN Mask       */

#define HSUSBD_BUSINTEN_SUSPENDIEN_Pos     (3)                                               /*!< HSUSBD_T::BUSINTEN: SUSPENDIEN Position  */
#define HSUSBD_BUSINTEN_SUSPENDIEN_Msk     (0x1ul << HSUSBD_BUSINTEN_SUSPENDIEN_Pos)         /*!< HSUSBD_T::BUSINTEN: SUSPENDIEN Mask      */

#define HSUSBD_BUSINTEN_HISPDIEN_Pos       (4)                                               /*!< HSUSBD_T::BUSINTEN: HISPDIEN Position    */
#define HSUSBD_BUSINTEN_HISPDIEN_Msk       (0x1ul << HSUSBD_BUSINTEN_HISPDIEN_Pos)           /*!< HSUSBD_T::BUSINTEN: HISPDIEN Mask        */

#define HSUSBD_BUSINTEN_DMADONEIEN_Pos     (5)                                               /*!< HSUSBD_T::BUSINTEN: DMADONEIEN Position  */
#define HSUSBD_BUSINTEN_DMADONEIEN_Msk     (0x1ul << HSUSBD_BUSINTEN_DMADONEIEN_Pos)         /*!< HSUSBD_T::BUSINTEN: DMADONEIEN Mask      */

#define HSUSBD_BUSINTEN_PHYCLKVLDIEN_Pos   (6)                                               /*!< HSUSBD_T::BUSINTEN: PHYCLKVLDIEN Position*/
#define HSUSBD_BUSINTEN_PHYCLKVLDIEN_Msk   (0x1ul << HSUSBD_BUSINTEN_PHYCLKVLDIEN_Pos)       /*!< HSUSBD_T::BUSINTEN: PHYCLKVLDIEN Mask    */

#define HSUSBD_BUSINTEN_VBUSDETIEN_Pos     (8)                                               /*!< HSUSBD_T::BUSINTEN: VBUSDETIEN Position  */
#define HSUSBD_BUSINTEN_VBUSDETIEN_Msk     (0x1ul << HSUSBD_BUSINTEN_VBUSDETIEN_Pos)         /*!< HSUSBD_T::BUSINTEN: VBUSDETIEN Mask      */

#define HSUSBD_BUSINTEN_LPMTKNIEN_Pos      (9)                                               /*!< HSUSBD_T::BUSINTEN: LPMTKNIEN Position   */
#define HSUSBD_BUSINTEN_LPMTKNIEN_Msk      (0x1ul << HSUSBD_BUSINTEN_LPMTKNIEN_Pos)          /*!< HSUSBD_T::BUSINTEN: LPMTKNIEN Mask       */

#define HSUSBD_OPER_RESUMEEN_Pos           (0)                                               /*!< HSUSBD_T::OPER: RESUMEEN Position        */
#define HSUSBD_OPER_RESUMEEN_Msk           (0x1ul << HSUSBD_OPER_RESUMEEN_Pos)               /*!< HSUSBD_T::OPER: RESUMEEN Mask            */

#define HSUSBD_OPER_HISPDEN_Pos            (1)                                               /*!< HSUSBD_T::OPER: HISPDEN Position         */
#define HSUSBD_OPER_HISPDEN_Msk            (0x1ul << HSUSBD_OPER_HISPDEN_Pos)                /*!< HSUSBD_T::OPER: HISPDEN Mask             */

#define HSUSBD_OPER_CURSPD_Pos             (2)                                               /*!< HSUSBD_T::OPER: CURSPD Position          */
#define HSUSBD_OPER_CURSPD_Msk             (0x1ul << HSUSBD_OPER_CURSPD_Pos)                 /*!< HSUSBD_T::OPER: CURSPD Mask              */

#define HSUSBD_OPER_HISHSEN_Pos            (3)                                               /*!< HSUSBD_T::OPER: HISHSEN Position         */
#define HSUSBD_OPER_HISHSEN_Msk            (0x1ul << HSUSBD_OPER_HISHSEN_Pos)                /*!< HSUSBD_T::OPER: HISHSEN Mask             */

#define HSUSBD_FRAMECNT_MFRAMECNT_Pos      (0)                                               /*!< HSUSBD_T::FRAMECNT: MFRAMECNT Position   */
#define HSUSBD_FRAMECNT_MFRAMECNT_Msk      (0x7ul << HSUSBD_FRAMECNT_MFRAMECNT_Pos)          /*!< HSUSBD_T::FRAMECNT: MFRAMECNT Mask       */

#define HSUSBD_FRAMECNT_FRAMECNT_Pos       (3)                                               /*!< HSUSBD_T::FRAMECNT: FRAMECNT Position    */
#define HSUSBD_FRAMECNT_FRAMECNT_Msk       (0x7fful << HSUSBD_FRAMECNT_FRAMECNT_Pos)         /*!< HSUSBD_T::FRAMECNT: FRAMECNT Mask        */

#define HSUSBD_FADDR_FADDR_Pos             (0)                                               /*!< HSUSBD_T::FADDR: FADDR Position          */
#define HSUSBD_FADDR_FADDR_Msk             (0x7ful << HSUSBD_FADDR_FADDR_Pos)                /*!< HSUSBD_T::FADDR: FADDR Mask              */

