yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
#define HSUSBD_TEST_TESTMODE_Pos           (0)                                               /*!< HSUSBD_T::TEST: TESTMODE Position        */
#define HSUSBD_TEST_TESTMODE_Msk           (0x7ul << HSUSBD_TEST_TESTMODE_Pos)               /*!< HSUSBD_T::TEST: TESTMODE Mask            */

#define HSUSBD_CEPDAT_DAT_Pos              (0)                                               /*!< HSUSBD_T::CEPDAT: DAT Position           */
#define HSUSBD_CEPDAT_DAT_Msk              (0xfffffffful << HSUSBD_CEPDAT_DAT_Pos)           /*!< HSUSBD_T::CEPDAT: DAT Mask               */

#define HSUSBD_CEPCTL_NAKCLR_Pos           (0)                                               /*!< HSUSBD_T::CEPCTL: NAKCLR Position        */
#define HSUSBD_CEPCTL_NAKCLR_Msk           (0x1ul << HSUSBD_CEPCTL_NAKCLR_Pos)               /*!< HSUSBD_T::CEPCTL: NAKCLR Mask            */

#define HSUSBD_CEPCTL_STALLEN_Pos          (1)                                               /*!< HSUSBD_T::CEPCTL: STALLEN Position       */
#define HSUSBD_CEPCTL_STALLEN_Msk          (0x1ul << HSUSBD_CEPCTL_STALLEN_Pos)              /*!< HSUSBD_T::CEPCTL: STALLEN Mask           */

#define HSUSBD_CEPCTL_ZEROLEN_Pos          (2)                                               /*!< HSUSBD_T::CEPCTL: ZEROLEN Position       */
#define HSUSBD_CEPCTL_ZEROLEN_Msk          (0x1ul << HSUSBD_CEPCTL_ZEROLEN_Pos)              /*!< HSUSBD_T::CEPCTL: ZEROLEN Mask           */

#define HSUSBD_CEPCTL_FLUSH_Pos            (3)                                               /*!< HSUSBD_T::CEPCTL: FLUSH Position         */
#define HSUSBD_CEPCTL_FLUSH_Msk            (0x1ul << HSUSBD_CEPCTL_FLUSH_Pos)                /*!< HSUSBD_T::CEPCTL: FLUSH Mask             */

#define HSUSBD_CEPINTEN_SETUPTKIEN_Pos     (0)                                               /*!< HSUSBD_T::CEPINTEN: SETUPTKIEN Position  */
#define HSUSBD_CEPINTEN_SETUPTKIEN_Msk     (0x1ul << HSUSBD_CEPINTEN_SETUPTKIEN_Pos)         /*!< HSUSBD_T::CEPINTEN: SETUPTKIEN Mask      */

#define HSUSBD_CEPINTEN_SETUPPKIEN_Pos     (1)                                               /*!< HSUSBD_T::CEPINTEN: SETUPPKIEN Position  */
#define HSUSBD_CEPINTEN_SETUPPKIEN_Msk     (0x1ul << HSUSBD_CEPINTEN_SETUPPKIEN_Pos)         /*!< HSUSBD_T::CEPINTEN: SETUPPKIEN Mask      */

#define HSUSBD_CEPINTEN_OUTTKIEN_Pos       (2)                                               /*!< HSUSBD_T::CEPINTEN: OUTTKIEN Position    */
#define HSUSBD_CEPINTEN_OUTTKIEN_Msk       (0x1ul << HSUSBD_CEPINTEN_OUTTKIEN_Pos)           /*!< HSUSBD_T::CEPINTEN: OUTTKIEN Mask        */

#define HSUSBD_CEPINTEN_INTKIEN_Pos        (3)                                               /*!< HSUSBD_T::CEPINTEN: INTKIEN Position     */
#define HSUSBD_CEPINTEN_INTKIEN_Msk        (0x1ul << HSUSBD_CEPINTEN_INTKIEN_Pos)            /*!< HSUSBD_T::CEPINTEN: INTKIEN Mask         */

#define HSUSBD_CEPINTEN_PINGIEN_Pos        (4)                                               /*!< HSUSBD_T::CEPINTEN: PINGIEN Position     */
#define HSUSBD_CEPINTEN_PINGIEN_Msk        (0x1ul << HSUSBD_CEPINTEN_PINGIEN_Pos)            /*!< HSUSBD_T::CEPINTEN: PINGIEN Mask         */

#define HSUSBD_CEPINTEN_TXPKIEN_Pos        (5)                                               /*!< HSUSBD_T::CEPINTEN: TXPKIEN Position     */
#define HSUSBD_CEPINTEN_TXPKIEN_Msk        (0x1ul << HSUSBD_CEPINTEN_TXPKIEN_Pos)            /*!< HSUSBD_T::CEPINTEN: TXPKIEN Mask         */

#define HSUSBD_CEPINTEN_RXPKIEN_Pos        (6)                                               /*!< HSUSBD_T::CEPINTEN: RXPKIEN Position     */
#define HSUSBD_CEPINTEN_RXPKIEN_Msk        (0x1ul << HSUSBD_CEPINTEN_RXPKIEN_Pos)            /*!< HSUSBD_T::CEPINTEN: RXPKIEN Mask         */

#define HSUSBD_CEPINTEN_NAKIEN_Pos         (7)                                               /*!< HSUSBD_T::CEPINTEN: NAKIEN Position      */
#define HSUSBD_CEPINTEN_NAKIEN_Msk         (0x1ul << HSUSBD_CEPINTEN_NAKIEN_Pos)             /*!< HSUSBD_T::CEPINTEN: NAKIEN Mask          */

#define HSUSBD_CEPINTEN_STALLIEN_Pos       (8)                                               /*!< HSUSBD_T::CEPINTEN: STALLIEN Position    */
#define HSUSBD_CEPINTEN_STALLIEN_Msk       (0x1ul << HSUSBD_CEPINTEN_STALLIEN_Pos)           /*!< HSUSBD_T::CEPINTEN: STALLIEN Mask        */

#define HSUSBD_CEPINTEN_ERRIEN_Pos         (9)                                               /*!< HSUSBD_T::CEPINTEN: ERRIEN Position      */
#define HSUSBD_CEPINTEN_ERRIEN_Msk         (0x1ul << HSUSBD_CEPINTEN_ERRIEN_Pos)             /*!< HSUSBD_T::CEPINTEN: ERRIEN Mask          */

#define HSUSBD_CEPINTEN_STSDONEIEN_Pos     (10)                                              /*!< HSUSBD_T::CEPINTEN: STSDONEIEN Position  */
#define HSUSBD_CEPINTEN_STSDONEIEN_Msk     (0x1ul << HSUSBD_CEPINTEN_STSDONEIEN_Pos)         /*!< HSUSBD_T::CEPINTEN: STSDONEIEN Mask      */

#define HSUSBD_CEPINTEN_BUFFULLIEN_Pos     (11)                                              /*!< HSUSBD_T::CEPINTEN: BUFFULLIEN Position  */
#define HSUSBD_CEPINTEN_BUFFULLIEN_Msk     (0x1ul << HSUSBD_CEPINTEN_BUFFULLIEN_Pos)         /*!< HSUSBD_T::CEPINTEN: BUFFULLIEN Mask      */

#define HSUSBD_CEPINTEN_BUFEMPTYIEN_Pos    (12)                                              /*!< HSUSBD_T::CEPINTEN: BUFEMPTYIEN Position */
#define HSUSBD_CEPINTEN_BUFEMPTYIEN_Msk    (0x1ul << HSUSBD_CEPINTEN_BUFEMPTYIEN_Pos)        /*!< HSUSBD_T::CEPINTEN: BUFEMPTYIEN Mask     */

#define HSUSBD_CEPINTSTS_SETUPTKIF_Pos     (0)                                               /*!< HSUSBD_T::CEPINTSTS: SETUPTKIF Position  */
#define HSUSBD_CEPINTSTS_SETUPTKIF_Msk     (0x1ul << HSUSBD_CEPINTSTS_SETUPTKIF_Pos)         /*!< HSUSBD_T::CEPINTSTS: SETUPTKIF Mask      */

#define HSUSBD_CEPINTSTS_SETUPPKIF_Pos     (1)                                               /*!< HSUSBD_T::CEPINTSTS: SETUPPKIF Position  */
#define HSUSBD_CEPINTSTS_SETUPPKIF_Msk     (0x1ul << HSUSBD_CEPINTSTS_SETUPPKIF_Pos)         /*!< HSUSBD_T::CEPINTSTS: SETUPPKIF Mask      */

#define HSUSBD_CEPINTSTS_OUTTKIF_Pos       (2)                                               /*!< HSUSBD_T::CEPINTSTS: OUTTKIF Position    */
#define HSUSBD_CEPINTSTS_OUTTKIF_Msk       (0x1ul << HSUSBD_CEPINTSTS_OUTTKIF_Pos)           /*!< HSUSBD_T::CEPINTSTS: OUTTKIF Mask        */

#define HSUSBD_CEPINTSTS_INTKIF_Pos        (3)                                               /*!< HSUSBD_T::CEPINTSTS: INTKIF Position     */
#define HSUSBD_CEPINTSTS_INTKIF_Msk        (0x1ul << HSUSBD_CEPINTSTS_INTKIF_Pos)            /*!< HSUSBD_T::CEPINTSTS: INTKIF Mask         */

#define HSUSBD_CEPINTSTS_PINGIF_Pos        (4)                                               /*!< HSUSBD_T::CEPINTSTS: PINGIF Position     */
#define HSUSBD_CEPINTSTS_PINGIF_Msk        (0x1ul << HSUSBD_CEPINTSTS_PINGIF_Pos)            /*!< HSUSBD_T::CEPINTSTS: PINGIF Mask         */

