yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
#define HSUSBD_CEPINTSTS_TXPKIF_Pos        (5)                                               /*!< HSUSBD_T::CEPINTSTS: TXPKIF Position     */
#define HSUSBD_CEPINTSTS_TXPKIF_Msk        (0x1ul << HSUSBD_CEPINTSTS_TXPKIF_Pos)            /*!< HSUSBD_T::CEPINTSTS: TXPKIF Mask         */

#define HSUSBD_CEPINTSTS_RXPKIF_Pos        (6)                                               /*!< HSUSBD_T::CEPINTSTS: RXPKIF Position     */
#define HSUSBD_CEPINTSTS_RXPKIF_Msk        (0x1ul << HSUSBD_CEPINTSTS_RXPKIF_Pos)            /*!< HSUSBD_T::CEPINTSTS: RXPKIF Mask         */

#define HSUSBD_CEPINTSTS_NAKIF_Pos         (7)                                               /*!< HSUSBD_T::CEPINTSTS: NAKIF Position      */
#define HSUSBD_CEPINTSTS_NAKIF_Msk         (0x1ul << HSUSBD_CEPINTSTS_NAKIF_Pos)             /*!< HSUSBD_T::CEPINTSTS: NAKIF Mask          */

#define HSUSBD_CEPINTSTS_STALLIF_Pos       (8)                                               /*!< HSUSBD_T::CEPINTSTS: STALLIF Position    */
#define HSUSBD_CEPINTSTS_STALLIF_Msk       (0x1ul << HSUSBD_CEPINTSTS_STALLIF_Pos)           /*!< HSUSBD_T::CEPINTSTS: STALLIF Mask        */

#define HSUSBD_CEPINTSTS_ERRIF_Pos         (9)                                               /*!< HSUSBD_T::CEPINTSTS: ERRIF Position      */
#define HSUSBD_CEPINTSTS_ERRIF_Msk         (0x1ul << HSUSBD_CEPINTSTS_ERRIF_Pos)             /*!< HSUSBD_T::CEPINTSTS: ERRIF Mask          */

#define HSUSBD_CEPINTSTS_STSDONEIF_Pos     (10)                                              /*!< HSUSBD_T::CEPINTSTS: STSDONEIF Position  */
#define HSUSBD_CEPINTSTS_STSDONEIF_Msk     (0x1ul << HSUSBD_CEPINTSTS_STSDONEIF_Pos)         /*!< HSUSBD_T::CEPINTSTS: STSDONEIF Mask      */

#define HSUSBD_CEPINTSTS_BUFFULLIF_Pos     (11)                                              /*!< HSUSBD_T::CEPINTSTS: BUFFULLIF Position  */
#define HSUSBD_CEPINTSTS_BUFFULLIF_Msk     (0x1ul << HSUSBD_CEPINTSTS_BUFFULLIF_Pos)         /*!< HSUSBD_T::CEPINTSTS: BUFFULLIF Mask      */

#define HSUSBD_CEPINTSTS_BUFEMPTYIF_Pos    (12)                                              /*!< HSUSBD_T::CEPINTSTS: BUFEMPTYIF Position */
#define HSUSBD_CEPINTSTS_BUFEMPTYIF_Msk    (0x1ul << HSUSBD_CEPINTSTS_BUFEMPTYIF_Pos)        /*!< HSUSBD_T::CEPINTSTS: BUFEMPTYIF Mask     */

#define HSUSBD_CEPTXCNT_TXCNT_Pos          (0)                                               /*!< HSUSBD_T::CEPTXCNT: TXCNT Position       */
#define HSUSBD_CEPTXCNT_TXCNT_Msk          (0xfful << HSUSBD_CEPTXCNT_TXCNT_Pos)             /*!< HSUSBD_T::CEPTXCNT: TXCNT Mask           */

#define HSUSBD_CEPRXCNT_RXCNT_Pos          (0)                                               /*!< HSUSBD_T::CEPRXCNT: RXCNT Position       */
#define HSUSBD_CEPRXCNT_RXCNT_Msk          (0xfful << HSUSBD_CEPRXCNT_RXCNT_Pos)             /*!< HSUSBD_T::CEPRXCNT: RXCNT Mask           */

#define HSUSBD_CEPDATCNT_DATCNT_Pos        (0)                                               /*!< HSUSBD_T::CEPDATCNT: DATCNT Position     */
#define HSUSBD_CEPDATCNT_DATCNT_Msk        (0xfffful << HSUSBD_CEPDATCNT_DATCNT_Pos)         /*!< HSUSBD_T::CEPDATCNT: DATCNT Mask         */

#define HSUSBD_SETUP1_0_SETUP0_Pos         (0)                                               /*!< HSUSBD_T::SETUP1_0: SETUP0 Position      */
#define HSUSBD_SETUP1_0_SETUP0_Msk         (0xfful << HSUSBD_SETUP1_0_SETUP0_Pos)            /*!< HSUSBD_T::SETUP1_0: SETUP0 Mask          */

#define HSUSBD_SETUP1_0_SETUP1_Pos         (8)                                               /*!< HSUSBD_T::SETUP1_0: SETUP1 Position      */
#define HSUSBD_SETUP1_0_SETUP1_Msk         (0xfful << HSUSBD_SETUP1_0_SETUP1_Pos)            /*!< HSUSBD_T::SETUP1_0: SETUP1 Mask          */

#define HSUSBD_SETUP3_2_SETUP2_Pos         (0)                                               /*!< HSUSBD_T::SETUP3_2: SETUP2 Position      */
#define HSUSBD_SETUP3_2_SETUP2_Msk         (0xfful << HSUSBD_SETUP3_2_SETUP2_Pos)            /*!< HSUSBD_T::SETUP3_2: SETUP2 Mask          */

#define HSUSBD_SETUP3_2_SETUP3_Pos         (8)                                               /*!< HSUSBD_T::SETUP3_2: SETUP3 Position      */
#define HSUSBD_SETUP3_2_SETUP3_Msk         (0xfful << HSUSBD_SETUP3_2_SETUP3_Pos)            /*!< HSUSBD_T::SETUP3_2: SETUP3 Mask          */

#define HSUSBD_SETUP5_4_SETUP4_Pos         (0)                                               /*!< HSUSBD_T::SETUP5_4: SETUP4 Position      */
#define HSUSBD_SETUP5_4_SETUP4_Msk         (0xfful << HSUSBD_SETUP5_4_SETUP4_Pos)            /*!< HSUSBD_T::SETUP5_4: SETUP4 Mask          */

#define HSUSBD_SETUP5_4_SETUP5_Pos         (8)                                               /*!< HSUSBD_T::SETUP5_4: SETUP5 Position      */
#define HSUSBD_SETUP5_4_SETUP5_Msk         (0xfful << HSUSBD_SETUP5_4_SETUP5_Pos)            /*!< HSUSBD_T::SETUP5_4: SETUP5 Mask          */

#define HSUSBD_SETUP7_6_SETUP6_Pos         (0)                                               /*!< HSUSBD_T::SETUP7_6: SETUP6 Position      */
#define HSUSBD_SETUP7_6_SETUP6_Msk         (0xfful << HSUSBD_SETUP7_6_SETUP6_Pos)            /*!< HSUSBD_T::SETUP7_6: SETUP6 Mask          */

#define HSUSBD_SETUP7_6_SETUP7_Pos         (8)                                               /*!< HSUSBD_T::SETUP7_6: SETUP7 Position      */
#define HSUSBD_SETUP7_6_SETUP7_Msk         (0xfful << HSUSBD_SETUP7_6_SETUP7_Pos)            /*!< HSUSBD_T::SETUP7_6: SETUP7 Mask          */

#define HSUSBD_CEPBUFSTART_SADDR_Pos       (0)                                               /*!< HSUSBD_T::CEPBUFSTART: SADDR Position    */
#define HSUSBD_CEPBUFSTART_SADDR_Msk       (0xffful << HSUSBD_CEPBUFSTART_SADDR_Pos)         /*!< HSUSBD_T::CEPBUFSTART: SADDR Mask        */

#define HSUSBD_CEPBUFEND_EADDR_Pos         (0)                                               /*!< HSUSBD_T::CEPBUFEND: EADDR Position      */
#define HSUSBD_CEPBUFEND_EADDR_Msk         (0xffful << HSUSBD_CEPBUFEND_EADDR_Pos)           /*!< HSUSBD_T::CEPBUFEND: EADDR Mask          */

#define HSUSBD_DMACTL_EPNUM_Pos            (0)                                               /*!< HSUSBD_T::DMACTL: EPNUM Position         */
#define HSUSBD_DMACTL_EPNUM_Msk            (0xful << HSUSBD_DMACTL_EPNUM_Pos)                /*!< HSUSBD_T::DMACTL: EPNUM Mask             */

