yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
#define HSUSBD_DMACTL_DMARD_Pos            (4)                                               /*!< HSUSBD_T::DMACTL: DMARD Position         */
#define HSUSBD_DMACTL_DMARD_Msk            (0x1ul << HSUSBD_DMACTL_DMARD_Pos)                /*!< HSUSBD_T::DMACTL: DMARD Mask             */

#define HSUSBD_DMACTL_DMAEN_Pos            (5)                                               /*!< HSUSBD_T::DMACTL: DMAEN Position         */
#define HSUSBD_DMACTL_DMAEN_Msk            (0x1ul << HSUSBD_DMACTL_DMAEN_Pos)                /*!< HSUSBD_T::DMACTL: DMAEN Mask             */

#define HSUSBD_DMACTL_SGEN_Pos             (6)                                               /*!< HSUSBD_T::DMACTL: SGEN Position          */
#define HSUSBD_DMACTL_SGEN_Msk             (0x1ul << HSUSBD_DMACTL_SGEN_Pos)                 /*!< HSUSBD_T::DMACTL: SGEN Mask              */

#define HSUSBD_DMACTL_DMARST_Pos           (7)                                               /*!< HSUSBD_T::DMACTL: DMARST Position        */
#define HSUSBD_DMACTL_DMARST_Msk           (0x1ul << HSUSBD_DMACTL_DMARST_Pos)               /*!< HSUSBD_T::DMACTL: DMARST Mask            */

#define HSUSBD_DMACTL_SVINEP_Pos           (8)                                               /*!< HSUSBD_T::DMACTL: SVINEP Position        */
#define HSUSBD_DMACTL_SVINEP_Msk           (0x1ul << HSUSBD_DMACTL_SVINEP_Pos)               /*!< HSUSBD_T::DMACTL: SVINEP Mask            */

#define HSUSBD_DMACNT_DMACNT_Pos           (0)                                               /*!< HSUSBD_T::DMACNT: DMACNT Position        */
#define HSUSBD_DMACNT_DMACNT_Msk           (0xffffful << HSUSBD_DMACNT_DMACNT_Pos)           /*!< HSUSBD_T::DMACNT: DMACNT Mask            */

#define HSUSBD_EPDAT_EPDAT_Pos             (0)                                               /*!< HSUSBD_T::EPDAT: EPDAT Position          */
#define HSUSBD_EPDAT_EPDAT_Msk             (0xfffffffful << HSUSBD_EPDAT_EPDAT_Pos)          /*!< HSUSBD_T::EPDAT: EPDAT Mask              */

#define HSUSBD_EPINTSTS_BUFFULLIF_Pos      (0)                                               /*!< HSUSBD_T::EPINTSTS: BUFFULLIF Position   */
#define HSUSBD_EPINTSTS_BUFFULLIF_Msk      (0x1ul << HSUSBD_EPINTSTS_BUFFULLIF_Pos)          /*!< HSUSBD_T::EPINTSTS: BUFFULLIF Mask       */

#define HSUSBD_EPINTSTS_BUFEMPTYIF_Pos     (1)                                               /*!< HSUSBD_T::EPINTSTS: BUFEMPTYIF Position  */
#define HSUSBD_EPINTSTS_BUFEMPTYIF_Msk     (0x1ul << HSUSBD_EPINTSTS_BUFEMPTYIF_Pos)         /*!< HSUSBD_T::EPINTSTS: BUFEMPTYIF Mask      */

#define HSUSBD_EPINTSTS_SHORTTXIF_Pos      (2)                                               /*!< HSUSBD_T::EPINTSTS: SHORTTXIF Position   */
#define HSUSBD_EPINTSTS_SHORTTXIF_Msk      (0x1ul << HSUSBD_EPINTSTS_SHORTTXIF_Pos)          /*!< HSUSBD_T::EPINTSTS: SHORTTXIF Mask       */

#define HSUSBD_EPINTSTS_TXPKIF_Pos         (3)                                               /*!< HSUSBD_T::EPINTSTS: TXPKIF Position      */
#define HSUSBD_EPINTSTS_TXPKIF_Msk         (0x1ul << HSUSBD_EPINTSTS_TXPKIF_Pos)             /*!< HSUSBD_T::EPINTSTS: TXPKIF Mask          */

#define HSUSBD_EPINTSTS_RXPKIF_Pos         (4)                                               /*!< HSUSBD_T::EPINTSTS: RXPKIF Position      */
#define HSUSBD_EPINTSTS_RXPKIF_Msk         (0x1ul << HSUSBD_EPINTSTS_RXPKIF_Pos)             /*!< HSUSBD_T::EPINTSTS: RXPKIF Mask          */

#define HSUSBD_EPINTSTS_OUTTKIF_Pos        (5)                                               /*!< HSUSBD_T::EPINTSTS: OUTTKIF Position     */
#define HSUSBD_EPINTSTS_OUTTKIF_Msk        (0x1ul << HSUSBD_EPINTSTS_OUTTKIF_Pos)            /*!< HSUSBD_T::EPINTSTS: OUTTKIF Mask         */

#define HSUSBD_EPINTSTS_INTKIF_Pos         (6)                                               /*!< HSUSBD_T::EPINTSTS: INTKIF Position      */
#define HSUSBD_EPINTSTS_INTKIF_Msk         (0x1ul << HSUSBD_EPINTSTS_INTKIF_Pos)             /*!< HSUSBD_T::EPINTSTS: INTKIF Mask          */

#define HSUSBD_EPINTSTS_PINGIF_Pos         (7)                                               /*!< HSUSBD_T::EPINTSTS: PINGIF Position      */
#define HSUSBD_EPINTSTS_PINGIF_Msk         (0x1ul << HSUSBD_EPINTSTS_PINGIF_Pos)             /*!< HSUSBD_T::EPINTSTS: PINGIF Mask          */

#define HSUSBD_EPINTSTS_NAKIF_Pos          (8)                                               /*!< HSUSBD_T::EPINTSTS: NAKIF Position       */
#define HSUSBD_EPINTSTS_NAKIF_Msk          (0x1ul << HSUSBD_EPINTSTS_NAKIF_Pos)              /*!< HSUSBD_T::EPINTSTS: NAKIF Mask           */

#define HSUSBD_EPINTSTS_STALLIF_Pos        (9)                                               /*!< HSUSBD_T::EPINTSTS: STALLIF Position     */
#define HSUSBD_EPINTSTS_STALLIF_Msk        (0x1ul << HSUSBD_EPINTSTS_STALLIF_Pos)            /*!< HSUSBD_T::EPINTSTS: STALLIF Mask         */

#define HSUSBD_EPINTSTS_NYETIF_Pos         (10)                                              /*!< HSUSBD_T::EPINTSTS: NYETIF Position      */
#define HSUSBD_EPINTSTS_NYETIF_Msk         (0x1ul << HSUSBD_EPINTSTS_NYETIF_Pos)             /*!< HSUSBD_T::EPINTSTS: NYETIF Mask          */

#define HSUSBD_EPINTSTS_ERRIF_Pos          (11)                                              /*!< HSUSBD_T::EPINTSTS: ERRIF Position       */
#define HSUSBD_EPINTSTS_ERRIF_Msk          (0x1ul << HSUSBD_EPINTSTS_ERRIF_Pos)              /*!< HSUSBD_T::EPINTSTS: ERRIF Mask           */

#define HSUSBD_EPINTSTS_SHORTRXIF_Pos      (12)                                              /*!< HSUSBD_T::EPINTSTS: SHORTRXIF Position   */
#define HSUSBD_EPINTSTS_SHORTRXIF_Msk      (0x1ul << HSUSBD_EPINTSTS_SHORTRXIF_Pos)          /*!< HSUSBD_T::EPINTSTS: SHORTRXIF Mask       */

#define HSUSBD_EPINTEN_BUFFULLIEN_Pos      (0)                                               /*!< HSUSBD_T::EPINTEN: BUFFULLIEN Position   */
#define HSUSBD_EPINTEN_BUFFULLIEN_Msk      (0x1ul << HSUSBD_EPINTEN_BUFFULLIEN_Pos)          /*!< HSUSBD_T::EPINTEN: BUFFULLIEN Mask       */

#define HSUSBD_EPINTEN_BUFEMPTYIEN_Pos     (1)                                               /*!< HSUSBD_T::EPINTEN: BUFEMPTYIEN Position  */
#define HSUSBD_EPINTEN_BUFEMPTYIEN_Msk     (0x1ul << HSUSBD_EPINTEN_BUFEMPTYIEN_Pos)         /*!< HSUSBD_T::EPINTEN: BUFEMPTYIEN Mask      */

#define HSUSBD_EPINTEN_SHORTTXIEN_Pos      (2)                                               /*!< HSUSBD_T::EPINTEN: SHORTTXIEN Position   */
#define HSUSBD_EPINTEN_SHORTTXIEN_Msk      (0x1ul << HSUSBD_EPINTEN_SHORTTXIEN_Pos)          /*!< HSUSBD_T::EPINTEN: SHORTTXIEN Mask       */

