yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
#define HSUSBD_EPINTEN_TXPKIEN_Pos         (3)                                               /*!< HSUSBD_T::EPINTEN: TXPKIEN Position      */
#define HSUSBD_EPINTEN_TXPKIEN_Msk         (0x1ul << HSUSBD_EPINTEN_TXPKIEN_Pos)             /*!< HSUSBD_T::EPINTEN: TXPKIEN Mask          */

#define HSUSBD_EPINTEN_RXPKIEN_Pos         (4)                                               /*!< HSUSBD_T::EPINTEN: RXPKIEN Position      */
#define HSUSBD_EPINTEN_RXPKIEN_Msk         (0x1ul << HSUSBD_EPINTEN_RXPKIEN_Pos)             /*!< HSUSBD_T::EPINTEN: RXPKIEN Mask          */

#define HSUSBD_EPINTEN_OUTTKIEN_Pos        (5)                                               /*!< HSUSBD_T::EPINTEN: OUTTKIEN Position     */
#define HSUSBD_EPINTEN_OUTTKIEN_Msk        (0x1ul << HSUSBD_EPINTEN_OUTTKIEN_Pos)            /*!< HSUSBD_T::EPINTEN: OUTTKIEN Mask         */

#define HSUSBD_EPINTEN_INTKIEN_Pos         (6)                                               /*!< HSUSBD_T::EPINTEN: INTKIEN Position      */
#define HSUSBD_EPINTEN_INTKIEN_Msk         (0x1ul << HSUSBD_EPINTEN_INTKIEN_Pos)             /*!< HSUSBD_T::EPINTEN: INTKIEN Mask          */

#define HSUSBD_EPINTEN_PINGIEN_Pos         (7)                                               /*!< HSUSBD_T::EPINTEN: PINGIEN Position      */
#define HSUSBD_EPINTEN_PINGIEN_Msk         (0x1ul << HSUSBD_EPINTEN_PINGIEN_Pos)             /*!< HSUSBD_T::EPINTEN: PINGIEN Mask          */

#define HSUSBD_EPINTEN_NAKIEN_Pos          (8)                                               /*!< HSUSBD_T::EPINTEN: NAKIEN Position       */
#define HSUSBD_EPINTEN_NAKIEN_Msk          (0x1ul << HSUSBD_EPINTEN_NAKIEN_Pos)              /*!< HSUSBD_T::EPINTEN: NAKIEN Mask           */

#define HSUSBD_EPINTEN_STALLIEN_Pos        (9)                                               /*!< HSUSBD_T::EPINTEN: STALLIEN Position     */
#define HSUSBD_EPINTEN_STALLIEN_Msk        (0x1ul << HSUSBD_EPINTEN_STALLIEN_Pos)            /*!< HSUSBD_T::EPINTEN: STALLIEN Mask         */

#define HSUSBD_EPINTEN_NYETIEN_Pos         (10)                                              /*!< HSUSBD_T::EPINTEN: NYETIEN Position      */
#define HSUSBD_EPINTEN_NYETIEN_Msk         (0x1ul << HSUSBD_EPINTEN_NYETIEN_Pos)             /*!< HSUSBD_T::EPINTEN: NYETIEN Mask          */

#define HSUSBD_EPINTEN_ERRIEN_Pos          (11)                                              /*!< HSUSBD_T::EPINTEN: ERRIEN Position       */
#define HSUSBD_EPINTEN_ERRIEN_Msk          (0x1ul << HSUSBD_EPINTEN_ERRIEN_Pos)              /*!< HSUSBD_T::EPINTEN: ERRIEN Mask           */

#define HSUSBD_EPINTEN_SHORTRXIEN_Pos      (12)                                              /*!< HSUSBD_T::EPINTEN: SHORTRXIEN Position   */
#define HSUSBD_EPINTEN_SHORTRXIEN_Msk      (0x1ul << HSUSBD_EPINTEN_SHORTRXIEN_Pos)          /*!< HSUSBD_T::EPINTEN: SHORTRXIEN Mask       */

#define HSUSBD_EPDATCNT_DATCNT_Pos         (0)                                               /*!< HSUSBD_T::EPDATCNT: DATCNT Position      */
#define HSUSBD_EPDATCNT_DATCNT_Msk         (0xfffful << HSUSBD_EPDATCNT_DATCNT_Pos)          /*!< HSUSBD_T::EPDATCNT: DATCNT Mask          */

#define HSUSBD_EPDATCNT_DMALOOP_Pos        (16)                                              /*!< HSUSBD_T::EPDATCNT: DMALOOP Position     */
#define HSUSBD_EPDATCNT_DMALOOP_Msk        (0x7ffful << HSUSBD_EPDATCNT_DMALOOP_Pos)         /*!< HSUSBD_T::EPDATCNT: DMALOOP Mask         */

#define HSUSBD_EPRSPCTL_FLUSH_Pos          (0)                                               /*!< HSUSBD_T::EPRSPCTL: FLUSH Position       */
#define HSUSBD_EPRSPCTL_FLUSH_Msk          (0x1ul << HSUSBD_EPRSPCTL_FLUSH_Pos)              /*!< HSUSBD_T::EPRSPCTL: FLUSH Mask           */

#define HSUSBD_EPRSPCTL_MODE_Pos           (1)                                               /*!< HSUSBD_T::EPRSPCTL: MODE Position        */
#define HSUSBD_EPRSPCTL_MODE_Msk           (0x3ul << HSUSBD_EPRSPCTL_MODE_Pos)               /*!< HSUSBD_T::EPRSPCTL: MODE Mask            */

#define HSUSBD_EPRSPCTL_TOGGLE_Pos         (3)                                               /*!< HSUSBD_T::EPRSPCTL: TOGGLE Position      */
#define HSUSBD_EPRSPCTL_TOGGLE_Msk         (0x1ul << HSUSBD_EPRSPCTL_TOGGLE_Pos)             /*!< HSUSBD_T::EPRSPCTL: TOGGLE Mask          */

#define HSUSBD_EPRSPCTL_HALT_Pos           (4)                                               /*!< HSUSBD_T::EPRSPCTL: HALT Position        */
#define HSUSBD_EPRSPCTL_HALT_Msk           (0x1ul << HSUSBD_EPRSPCTL_HALT_Pos)               /*!< HSUSBD_T::EPRSPCTL: HALT Mask            */

#define HSUSBD_EPRSPCTL_ZEROLEN_Pos        (5)                                               /*!< HSUSBD_T::EPASPCTL: ZEROLEN Position     */
#define HSUSBD_EPRSPCTL_ZEROLEN_Msk        (0x1ul << HSUSBD_EPRSPCTL_ZEROLEN_Pos)            /*!< HSUSBD_T::EPRSPCTL: ZEROLEN Mask         */

#define HSUSBD_EPRSPCTL_SHORTTXEN_Pos      (6)                                               /*!< HSUSBD_T::EPRSPCTL: SHORTTXEN Position   */
#define HSUSBD_EPRSPCTL_SHORTTXEN_Msk      (0x1ul << HSUSBD_EPRSPCTL_SHORTTXEN_Pos)          /*!< HSUSBD_T::EPRSPCTL: SHORTTXEN Mask       */

#define HSUSBD_EPRSPCTL_DISBUF_Pos         (7)                                               /*!< HSUSBD_T::EPRSPCTL: DISBUF Position      */
#define HSUSBD_EPRSPCTL_DISBUF_Msk         (0x1ul << HSUSBD_EPRSPCTL_DISBUF_Pos)             /*!< HSUSBD_T::EPRSPCTL: DISBUF Mask          */

#define HSUSBD_EPMPS_EPMPS_Pos             (0)                                               /*!< HSUSBD_T::EPMPS: EPMPS Position          */
#define HSUSBD_EPMPS_EPMPS_Msk             (0x7fful << HSUSBD_EPMPS_EPMPS_Pos)               /*!< HSUSBD_T::EPMPS: EPMPS Mask              */

#define HSUSBD_EPTXCNT_TXCNT_Pos           (0)                                               /*!< HSUSBD_T::EPTXCNT: TXCNT Position        */
#define HSUSBD_EPTXCNT_TXCNT_Msk           (0x7fful << HSUSBD_EPTXCNT_TXCNT_Pos)             /*!< HSUSBD_T::EPTXCNT: TXCNT Mask            */

#define HSUSBD_EPCFG_EPEN_Pos              (0)                                               /*!< HSUSBD_T::EPCFG: EPEN Position           */
#define HSUSBD_EPCFG_EPEN_Msk              (0x1ul << HSUSBD_EPCFG_EPEN_Pos)                  /*!< HSUSBD_T::EPCFG: EPEN Mask               */

#define HSUSBD_EPCFG_EPTYPE_Pos            (1)                                               /*!< HSUSBD_T::EPCFG: EPTYPE Position         */
#define HSUSBD_EPCFG_EPTYPE_Msk            (0x3ul << HSUSBD_EPCFG_EPTYPE_Pos)                /*!< HSUSBD_T::EPCFG: EPTYPE Mask             */

#define HSUSBD_EPCFG_EPDIR_Pos             (3)                                               /*!< HSUSBD_T::EPCFG: EPDIR Position          */
#define HSUSBD_EPCFG_EPDIR_Msk             (0x1ul << HSUSBD_EPCFG_EPDIR_Pos)                 /*!< HSUSBD_T::EPCFG: EPDIR Mask              */

#define HSUSBD_EPCFG_EPNUM_Pos             (4)                                               /*!< HSUSBD_T::EPCFG: EPNUM Position          */
#define HSUSBD_EPCFG_EPNUM_Msk             (0xful << HSUSBD_EPCFG_EPNUM_Pos)                 /*!< HSUSBD_T::EPCFG: EPNUM Mask              */

#define HSUSBD_EPCFG_MTRANS_Pos            (8)                                               /*!< HSUSBD_T::EPCFG: MTRANS Position         */
#define HSUSBD_EPCFG_MTRANS_Msk            (0x3ul << HSUSBD_EPCFG_MTRANS_Pos)                /*!< HSUSBD_T::EPCFG: MTRANS Mask             */

#define HSUSBD_EPBUFSTART_SADDR_Pos        (0)                                               /*!< HSUSBD_T::EPBUFSTART: SADDR Position     */
#define HSUSBD_EPBUFSTART_SADDR_Msk        (0x1ffful << HSUSBD_EPBUFSTART_SADDR_Pos)         /*!< HSUSBD_T::EPBUFSTART: SADDR Mask         */

#define HSUSBD_EPBUFEND_EADDR_Pos          (0)                                               /*!< HSUSBD_T::EPBUFEND: EADDR Position       */
#define HSUSBD_EPBUFEND_EADDR_Msk          (0x1ffful << HSUSBD_EPBUFEND_EADDR_Pos)           /*!< HSUSBD_T::EPBUFEND: EADDR Mask           */

