yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/hsusbd_reg.h
#define HSUSBD_LPMCSR_bmAttributes_Pos     (0)                                               /*!< HSUSBD_T::LPMCSR: bmAttributes Position  */
#define HSUSBD_LPMCSR_bmAttributes_Msk     (0x7fful << HSUSBD_LPMCSR_bmAttributes_Pos)       /*!< HSUSBD_T::LPMCSR: bmAttributes Mask      */

#define HSUSBD_LPMCSR_LPMEN_Pos            (12)                                              /*!< HSUSBD_T::LPMCSR: LPMEN Position         */
#define HSUSBD_LPMCSR_LPMEN_Msk            (0x1ul << HSUSBD_LPMCSR_LPMEN_Pos)                /*!< HSUSBD_T::LPMCSR: LPMEN Mask             */

#define HSUSBD_LPMCSR_LPMSLEEPEN_Pos       (13)                                              /*!< HSUSBD_T::LPMCSR: LPMSLEEPEN Position    */
#define HSUSBD_LPMCSR_LPMSLEEPEN_Msk       (0x1ul << HSUSBD_LPMCSR_LPMSLEEPEN_Pos)           /*!< HSUSBD_T::LPMCSR: LPMSLEEPEN Mask        */

#define HSUSBD_LPMCSR_LPMSENDNYET_Pos      (14)                                              /*!< HSUSBD_T::LPMCSR: LPMSENDNYET Position   */
#define HSUSBD_LPMCSR_LPMSENDNYET_Msk      (0x1ul << HSUSBD_LPMCSR_LPMSENDNYET_Pos)          /*!< HSUSBD_T::LPMCSR: LPMSENDNYET Mask       */

#define HSUSBD_DMAADDR_DMAADDR_Pos         (0)                                               /*!< HSUSBD_T::DMAADDR: DMAADDR Position      */
#define HSUSBD_DMAADDR_DMAADDR_Msk         (0xfffffffful << HSUSBD_DMAADDR_DMAADDR_Pos)      /*!< HSUSBD_T::DMAADDR: DMAADDR Mask          */

#define HSUSBD_PHYCTL_DPPUEN_Pos           (8)                                               /*!< HSUSBD_T::PHYCTL: DPPUEN Position        */
#define HSUSBD_PHYCTL_DPPUEN_Msk           (0x1ul << HSUSBD_PHYCTL_DPPUEN_Pos)               /*!< HSUSBD_T::PHYCTL: DPPUEN Mask            */

#define HSUSBD_PHYCTL_PHYEN_Pos            (9)                                               /*!< HSUSBD_T::PHYCTL: PHYEN Position         */
#define HSUSBD_PHYCTL_PHYEN_Msk            (0x1ul << HSUSBD_PHYCTL_PHYEN_Pos)                /*!< HSUSBD_T::PHYCTL: PHYEN Mask             */

#define HSUSBD_PHYCTL_VBUSWKEN_Pos         (24)                                              /*!< HSUSBD_T::PHYCTL: VBUSWKEN Position      */
#define HSUSBD_PHYCTL_VBUSWKEN_Msk         (0x1ul << HSUSBD_PHYCTL_VBUSWKEN_Pos)             /*!< HSUSBD_T::PHYCTL: VBUSWKEN Mask          */

#define HSUSBD_PHYCTL_LINESTATEWKEN_Pos    (25)                                              /*!< HSUSBD_T::PHYCTL: LINESTATEWKEN Position */
#define HSUSBD_PHYCTL_LINESTATEWKEN_Msk    (0x1ul << HSUSBD_PHYCTL_LINESTATEWKEN_Pos)        /*!< HSUSBD_T::PHYCTL: LINESTATEWKEN Mask     */

#define HSUSBD_PHYCTL_STALLREVERT_Pos      (26)                                              /*!< HSUSBD_T::PHYCTL: STALLREVERT Position   */
#define HSUSBD_PHYCTL_STALLREVERT_Msk      (0x1ul << HSUSBD_PHYCTL_STALLREVERT_Pos)          /*!< HSUSBD_T::PHYCTL: STALLREVERT Mask       */

#define HSUSBD_PHYCTL_PHYCLKSTB_Pos        (27)                                              /*!< HSUSBD_T::PHYCTL: PHYCLKSTB Position     */
#define HSUSBD_PHYCTL_PHYCLKSTB_Msk        (0x1ul << HSUSBD_PHYCTL_PHYCLKSTB_Pos)            /*!< HSUSBD_T::PHYCTL: PHYCLKSTB Mask         */

#define HSUSBD_PHYCTL_VBUSDET_Pos          (31)                                              /*!< HSUSBD_T::PHYCTL: VBUSDET Position       */
#define HSUSBD_PHYCTL_VBUSDET_Msk          (0x1ul << HSUSBD_PHYCTL_VBUSDET_Pos)              /*!< HSUSBD_T::PHYCTL: VBUSDET Mask           */

/**@}*/ /* HSUSBD_CONST */
/**@}*/ /* end of HSUSBD register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __HSUSBD_REG_H__ */
